{
    "somef_provenance": {
        "somef_version": "0.9.5",
        "somef_schema_version": "1.0.0",
        "date": "2024-10-03 18:59:32"
    },
    "code_repository": [
        {
            "result": {
                "value": "https://github.com/acmsigsoft/EmpiricalStandards",
                "type": "Url"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "owner": [
        {
            "result": {
                "value": "acmsigsoft",
                "type": "Organization"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "date_created": [
        {
            "result": {
                "value": "2020-09-16T15:54:52Z",
                "type": "Date"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "date_updated": [
        {
            "result": {
                "value": "2024-09-23T20:00:44Z",
                "type": "Date"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "license": [
        {
            "result": {
                "value": "https://api.github.com/licenses/cc0-1.0",
                "type": "License",
                "name": "Creative Commons Zero v1.0 Universal",
                "url": "https://api.github.com/licenses/cc0-1.0",
                "spdx_id": "CC0-1.0"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        },
        {
            "result": {
                "value": "Creative Commons Legal Code\n\nCC0 1.0 Universal\n\n    CREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE\n    LEGAL SERVICES. DISTRIBUTION OF THIS DOCUMENT DOES NOT CREATE AN\n    ATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS\n    INFORMATION ON AN \"AS-IS\" BASIS. CREATIVE COMMONS MAKES NO WARRANTIES\n    REGARDING THE USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS\n    PROVIDED HEREUNDER, AND DISCLAIMS LIABILITY FOR DAMAGES RESULTING FROM\n    THE USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS PROVIDED\n    HEREUNDER.\n\nStatement of Purpose\n\nThe laws of most jurisdictions throughout the world automatically confer\nexclusive Copyright and Related Rights (defined below) upon the creator\nand subsequent owner(s) (each and all, an \"owner\") of an original work of\nauthorship and/or a database (each, a \"Work\").\n\nCertain owners wish to permanently relinquish those rights to a Work for\nthe purpose of contributing to a commons of creative, cultural and\nscientific works (\"Commons\") that the public can reliably and without fear\nof later claims of infringement build upon, modify, incorporate in other\nworks, reuse and redistribute as freely as possible in any form whatsoever\nand for any purposes, including without limitation commercial purposes.\nThese owners may contribute to the Commons to promote the ideal of a free\nculture and the further production of creative, cultural and scientific\nworks, or to gain reputation or greater distribution for their Work in\npart through the use and efforts of others.\n\nFor these and/or other purposes and motivations, and without any\nexpectation of additional consideration or compensation, the person\nassociating CC0 with a Work (the \"Affirmer\"), to the extent that he or she\nis an owner of Copyright and Related Rights in the Work, voluntarily\nelects to apply CC0 to the Work and publicly distribute the Work under its\nterms, with knowledge of his or her Copyright and Related Rights in the\nWork and the meaning and intended legal effect of CC0 on those rights.\n\n1. Copyright and Related Rights. A Work made available under CC0 may be\nprotected by copyright and related or neighboring rights (\"Copyright and\nRelated Rights\"). Copyright and Related Rights include, but are not\nlimited to, the following:\n\n  i. the right to reproduce, adapt, distribute, perform, display,\n     communicate, and translate a Work;\n ii. moral rights retained by the original author(s) and/or performer(s);\niii. publicity and privacy rights pertaining to a person's image or\n     likeness depicted in a Work;\n iv. rights protecting against unfair competition in regards to a Work,\n     subject to the limitations in paragraph 4(a), below;\n  v. rights protecting the extraction, dissemination, use and reuse of data\n     in a Work;\n vi. database rights (such as those arising under Directive 96/9/EC of the\n     European Parliament and of the Council of 11 March 1996 on the legal\n     protection of databases, and under any national implementation\n     thereof, including any amended or successor version of such\n     directive); and\nvii. other similar, equivalent or corresponding rights throughout the\n     world based on applicable law or treaty, and any national\n     implementations thereof.\n\n2. Waiver. To the greatest extent permitted by, but not in contravention\nof, applicable law, Affirmer hereby overtly, fully, permanently,\nirrevocably and unconditionally waives, abandons, and surrenders all of\nAffirmer's Copyright and Related Rights and associated claims and causes\nof action, whether now known or unknown (including existing as well as\nfuture claims and causes of action), in the Work (i) in all territories\nworldwide, (ii) for the maximum duration provided by applicable law or\ntreaty (including future time extensions), (iii) in any current or future\nmedium and for any number of copies, and (iv) for any purpose whatsoever,\nincluding without limitation commercial, advertising or promotional\npurposes (the \"Waiver\"). Affirmer makes the Waiver for the benefit of each\nmember of the public at large and to the detriment of Affirmer's heirs and\nsuccessors, fully intending that such Waiver shall not be subject to\nrevocation, rescission, cancellation, termination, or any other legal or\nequitable action to disrupt the quiet enjoyment of the Work by the public\nas contemplated by Affirmer's express Statement of Purpose.\n\n3. Public License Fallback. Should any part of the Waiver for any reason\nbe judged legally invalid or ineffective under applicable law, then the\nWaiver shall be preserved to the maximum extent permitted taking into\naccount Affirmer's express Statement of Purpose. In addition, to the\nextent the Waiver is so judged Affirmer hereby grants to each affected\nperson a royalty-free, non transferable, non sublicensable, non exclusive,\nirrevocable and unconditional license to exercise Affirmer's Copyright and\nRelated Rights in the Work (i) in all territories worldwide, (ii) for the\nmaximum duration provided by applicable law or treaty (including future\ntime extensions), (iii) in any current or future medium and for any number\nof copies, and (iv) for any purpose whatsoever, including without\nlimitation commercial, advertising or promotional purposes (the\n\"License\"). The License shall be deemed effective as of the date CC0 was\napplied by Affirmer to the Work. Should any part of the License for any\nreason be judged legally invalid or ineffective under applicable law, such\npartial invalidity or ineffectiveness shall not invalidate the remainder\nof the License, and in such case Affirmer hereby affirms that he or she\nwill not (i) exercise any of his or her remaining Copyright and Related\nRights in the Work or (ii) assert any associated claims and causes of\naction with respect to the Work, in either case contrary to Affirmer's\nexpress Statement of Purpose.\n\n4. Limitations and Disclaimers.\n\n a. No trademark or patent rights held by Affirmer are waived, abandoned,\n    surrendered, licensed or otherwise affected by this document.\n b. Affirmer offers the Work as-is and makes no representations or\n    warranties of any kind concerning the Work, express, implied,\n    statutory or otherwise, including without limitation warranties of\n    title, merchantability, fitness for a particular purpose, non\n    infringement, or the absence of latent or other defects, accuracy, or\n    the present or absence of errors, whether or not discoverable, all to\n    the greatest extent permissible under applicable law.\n c. Affirmer disclaims responsibility for clearing rights of other persons\n    that may apply to the Work or any use thereof, including without\n    limitation any person's Copyright and Related Rights in the Work.\n    Further, Affirmer disclaims responsibility for obtaining any necessary\n    consents, permissions or other rights required for any use of the\n    Work.\n d. Affirmer understands and acknowledges that Creative Commons is not a\n    party to this document and has no duty or obligation with respect to\n    this CC0 or use of the Work.\n",
                "type": "File_dump"
            },
            "confidence": 1,
            "technique": "file_exploration",
            "source": "https://raw.githubusercontent.com/acmsigsoft/EmpiricalStandards/master/LICENSE"
        }
    ],
    "description": [
        {
            "result": {
                "value": "Tools and standards for conducting and evaluating research in software engineering",
                "type": "String"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        },
        {
            "result": {
                "value": "You can learn more about how the standards were created and are maintained by reading the empirical standards report [3].\n",
                "type": "Text_excerpt",
                "original_header": "Creation and Maintenance",
                "parent_header": [
                    "Empirical Standards"
                ]
            },
            "confidence": 1,
            "technique": "header_analysis",
            "source": "https://raw.githubusercontent.com/acmsigsoft/EmpiricalStandards/master/README.md"
        },
        {
            "result": {
                "type": "Text_excerpt",
                "value": "Evidence standards can include expectations about the way research is conducted (method) and reported, as well as the type or quantity of evidence expected to justify a specific intervention. The Software Engineering (SE) Empirical Standards focus on the first two---they express the SE community's collective expectations for research methodology and reporting. Here _empirical_ denotes research that uses data rather than a mathematical proof or a philosophical treatise. The data can be qualitative or quantitative; real or synthetic. \"Empirical\" does **not** mean \"positivist.\" \nOur empirical standards build on evidence standards from other disciplines, but are significantly more ambitious: \n * Unlike some previous attempts, our standards are method-specific. Software engineering researchers use many different research methods. A single standard for all empirical research would either be biased against some methods or radically incomplete. We have totally different expectations for a controlled experiment and an ethnographic case study. Therefore, the standard for controlled experiments is quite different from the standard for case studies. Our standards cover more methods (and philosophical positions) than any other field's.  \n * Our empirical standards are models of the software engineering community's expectations. That is, most of a standard should appear reasonable to most of the subset of our community that's familiar with that kind of research. The standards should both reflect, and help build, consensus. Therefore, they are hosted on github, and any researcher can report issues and directly implement improvements.\n * Evidence standards can be difficult to apply. Therefore, we have prototyped tools to help authors and reviewers check their manuscripts against relevant standards.\n   \n",
                "original_header": "Empirical Standards"
            },
            "confidence": 0.9310971480212341,
            "technique": "supervised_classification",
            "source": "https://raw.githubusercontent.com/acmsigsoft/EmpiricalStandards/master/README.md"
        }
    ],
    "name": [
        {
            "result": {
                "value": "EmpiricalStandards",
                "type": "String"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "full_name": [
        {
            "result": {
                "value": "acmsigsoft/EmpiricalStandards",
                "type": "String"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "issue_tracker": [
        {
            "result": {
                "value": "https://api.github.com/repos/acmsigsoft/EmpiricalStandards/issues",
                "type": "Url"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "forks_url": [
        {
            "result": {
                "value": "https://api.github.com/repos/acmsigsoft/EmpiricalStandards/forks",
                "type": "Url"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "stargazers_count": [
        {
            "result": {
                "value": 288,
                "type": "Number"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "keywords": [
        {
            "result": {
                "value": "empirical-standards, research, sigsoft, softwareengineering, standards",
                "type": "String"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "forks_count": [
        {
            "result": {
                "value": 60,
                "type": "Number"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "download_url": [
        {
            "result": {
                "value": "https://github.com/acmsigsoft/EmpiricalStandards/releases",
                "type": "Url"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "programming_languages": [
        {
            "result": {
                "value": "JavaScript",
                "name": "JavaScript",
                "type": "Programming_language",
                "size": 101177
            },
            "confidence": 1,
            "technique": "GitHub_API"
        },
        {
            "result": {
                "value": "HTML",
                "name": "HTML",
                "type": "Programming_language",
                "size": 20851
            },
            "confidence": 1,
            "technique": "GitHub_API"
        },
        {
            "result": {
                "value": "CSS",
                "name": "CSS",
                "type": "Programming_language",
                "size": 2169
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "readme_url": [
        {
            "result": {
                "value": "https://raw.githubusercontent.com/acmsigsoft/EmpiricalStandards/master/README.md",
                "type": "Url"
            },
            "confidence": 1,
            "technique": "file_exploration"
        }
    ],
    "contributing_guidelines": [
        {
            "result": {
                "value": "# Issues\n\nPlease use the Issues feature to suggest changes to the standards. \n\n# Contributing\n\nIf you would like to contribute directly to the empirical standards, please contact Prof. Paul Ralph at <paul@paulralph.name>. \n\n## Intellectual property notice\n\nAs stated in [GitHub Policies](https://github.com/github/site-policy/blob/1263bf0164cfe60d0900e70ba9126855c7c23c6c/Policies/github-terms-of-service.md#6-contributions-under-repository-license), if you contribute to the open science licenses you implicitly accept that your contributions are licensed the same as the open science policies. \n\nBy contributing here, **you forfeit the copyright of your contribution** to have the whole work licensed as CC0 1.0 Universal (see LICENSE).\n\n# Future plans\n\nWhen the standards are more mature, we hope to implement them more directly such that we can use pull requests and forks to manage changes. However, this may take a while.  \n",
                "type": "File_dump"
            },
            "confidence": 1,
            "technique": "file_exploration",
            "source": "https://raw.githubusercontent.com/acmsigsoft/EmpiricalStandards/master/Contributing.md"
        }
    ],
    "documentation": [
        {
            "result": {
                "value": "https://github.com/acmsigsoft/EmpiricalStandards/tree/master/docs",
                "type": "Url"
            },
            "confidence": 1,
            "technique": "file_exploration"
        }
    ],
    "has_script_file": [
        {
            "result": {
                "value": "https://raw.githubusercontent.com/acmsigsoft/EmpiricalStandards/master/docs/build.sh",
                "type": "Url"
            },
            "confidence": 1,
            "technique": "file_exploration"
        }
    ],
    "contributors": [
        {
            "result": {
                "value": "## Contributors\n\n### Editor-in-Chief\n\n**Paul Ralph**, *PhD (British Columbia), B.Sc. / B.Comm (Memorial),* is an award-winning scientist, author, consultant and Professor of Software Engineering at Dalhousie University in Halifax, Canada. Paul chaired the ACM SIGSOFT Paper and Peer Review Quality Initiative and has written extensively on research methodology for software engineering.\n\n### Content Contributors\n\n**Nauman bin Ali**, Blekinge Institute of Technology, Sweden [Quantitative Simulations]\n\n**Sebastian Baltes**, University of Adelaide, Australia [Sampling]\n\n**David Bermbach**, TU Berlin, Germany [Benchmarking]\n\n**Domenico Bianculli**, University of Luxemburg, Luxemburg [Engineering]\n\n**Jeffrey C. Carver**, University of Alabama, USA [Replication]\n\n**Preetha Chatterjee**, Drexel University, USA [Repository Mining]\n\n**Istvan David**, McMaster University, Canada [Replication]\n\n**Jessica Diaz**, Technical University of Madrid, Spain [IRR/IRA]\n\n**Yvonne Dittrich**, IT University of Copenhagen, Denmark [Action Research]\n\n**Neil Ernst**, University of Victoria, Canada [Pre-registration]\n\n**Michael Felderer**, University of Innsbruck, Austria [Action Research, Case Study]\n\n**Robert Feldt**, Chalmers University of Technology, Sweden [General]\n\n**Antonio Filieri**, Imperial College London, UK [Engineering]\n\n**Breno Bernard Nicolau de França**, University of Campinas, Brazil [Quantitative Simulations]\n\n**Carlo Alberto Furia**, USI Lugano, Switzerland [Engineering]\n\n**Gregory Gay**, Chalmers University / University of Gothenburg, Sweden [Optimization Studies]\n\n**Daniel German**, University of Victoria, Canada [Repository Mining]\n\n**Nicolas Gold**, University College London, UK [Ethics]\n\n**Daniel Graziotin**, University of Stuttgart, Germany [Open Science]\n\n**Wilhelm Hasselbring**, Kiel University, Germany [Benchmarking]\n\n**Pinjia He**, ETH Zurich, Switzerland [General]\n\n**Sören Henning**, Kiel University, Germany [Benchmarking]\n\n**Rashina Hoda**, Monash University, Australia [Grounded Theory]\n\n**Natalia Juristo**, Technical University of Madrid, Spain [Controlled Experiment]\n\n**Barbara Kitchenham**, Keele University, UK [Systematic Reviews]\n\n**Valentina Lenarduzzi**, University of Oulu, Finland [Longitudinal Studies]\n\n**Jorge Martínez**, Universidad Politécnica de Madrid, Spain [IRR/IRA]\n\n**Jorge Melegati**, Free University of Bozen-Bolzano, Italy [Case Survey]\n\n**Daniel Mendez**, Blekinge Institute of Technology, Sweden, and fortiss GmbH, Germany [Questionnaire]\n\n**Tim Menzies**, NC State University, USA [Exploratory Data Science; Optimization Studies]\n\n**Rahul Mohanani**, The University of Jyväskylä, Finland [Qualitative Simulations]\n\n**Jefferson Molleri**, Simula Metropolitan Centre for Digital Engineering, Norway [Questionnaire]\n\n**Dietmar Pfahl**, University of Tartu, Estonia [Quantitative Simulations]\n\n**Romain Robbes**, Free University of Bozen-Bolzano, Italy [Data Science]\n\n**Daniel Russo**, Aalborg University, Denmark [Longitudinal Studies]\n\n**Nyyti Saarimäki**, Tampere University, Finland [Longitudinal Studies]\n\n**Federica Sarro**, University College London, UK [Optimization Studies]\n\n**Tushar Sharma**, Dalhousie University, Canada [Repository Mining]\n\n**Janet Siegmund**, Chemnitz University of Technology, Germany [Pre-registration]\n\n**Diomidis Spinellis**, Athens University of Economics and Business, Greece [Systematic Reviews]\n\n**Miroslaw Staron**, University of Gothenburg, Sweden [Action Research]\n\n**Klaas Stol**, University College Cork, Ireland [Case Study]\n\n**Margaret-Anne (Peggy) Storey**, University of Victoria, Canada [Multimethodology and Mixed Methods]\n\n**Davide Taibi**, Tampere University, Finland [Longitudinal Studies]\n\n**Damian Tamburri**, Eindhoven University of Technology, Netherlands [Case Study; Exploratory Data Science]\n\n**Marco Torchiano**, Polytechnic University of Turin, Italy [Information Visualization, Questionnaire]\n\n**Christoph Treude**, University of Melbourne, Australia [Grounded Theory]\n\n**Burak Turhan**, Monash University, Australia [Controlled Experiment]\n\n**Xiaofeng Wang**, Free University of Bozen-Bolzano, Italy [Case Survey]\n\n**Sira Vegas**, Technical University of Madrid, Spain [Controlled Experiment]\n\n**Melina Vidoni**, The Australian National University, Australia [Repository Mining]\n\n### Technical Contributors\n\n**Arham Arshad**, Dalhousie University, Canada\n\n**Taher Ghaleb**, Queen&#39;s University, Canada\n\n**Erin Schultz**, Dalhousie University, Canada\n\n",
                "type": "File_dump"
            },
            "confidence": 1,
            "technique": "file_exploration",
            "source": "https://raw.githubusercontent.com/acmsigsoft/EmpiricalStandards/master/_team/contributors.md"
        }
    ],
    "installation": [
        {
            "result": {
                "value": "Scholarly peer review is simultaneously “the lynchpin about which the whole business of science is pivoted\" [1] and \"prejudiced, capricious, inefficient, ineffective, and generally unscientific” [2]. Many of the problems with peer review boiled down to reviewers inventing their own evaluation criteria. Devising appropriate evaluation criteria for any given manuscript is extraordinarily difficult, so most reviewers' criteria are not very good. Reviewers create criteria that are inconsistent with other reviewers', the venue's, the editor's, the methodological literature and---crucially---the author's. In effect, the real criteria by which our research is judged are not merely opaque; they don't even exist until after the manuscript is submitted. This is why peer review is so frustrating, unpredictable, and unscientific. \n\nEmpirical standards are the secret to fixing this situation. With the standards, all the reviewers use the same criteria and the authors know the criteria in advance. Used appropriately, the standards discourage reviewers from either accepting research with fatal flaws or rejecting research based on bogus criteria. \n",
                "type": "Text_excerpt",
                "original_header": "1. Fixing peer review",
                "parent_header": [
                    "Empirical Standards",
                    "What are Empirical Standards for?"
                ]
            },
            "confidence": 1,
            "technique": "header_analysis",
            "source": "https://raw.githubusercontent.com/acmsigsoft/EmpiricalStandards/master/README.md"
        },
        {
            "result": {
                "type": "Text_excerpt",
                "value": "Please refer to the following [ReadMe File](/docs/ReadMe.md) for detailed instructions \n",
                "original_header": "Attribute Customization and Validation"
            },
            "confidence": 0.9735173650465866,
            "technique": "supervised_classification",
            "source": "https://raw.githubusercontent.com/acmsigsoft/EmpiricalStandards/master/README.md"
        }
    ],
    "support": [
        {
            "result": {
                "value": "Obviously, if authors have these criteria in advance, they can use the criteria to design more rigorous studies. There's a lot to remember when designing a study, and robust methodological training is rare in our community. The standards provide concise, convenient checklists to help us remember all the core practices for a given method.   \n",
                "type": "Text_excerpt",
                "original_header": "2. Designing better studies",
                "parent_header": [
                    "Empirical Standards",
                    "What are Empirical Standards for?"
                ]
            },
            "confidence": 1,
            "technique": "header_analysis",
            "source": "https://raw.githubusercontent.com/acmsigsoft/EmpiricalStandards/master/README.md"
        }
    ],
    "citation": [
        {
            "result": {
                "value": "[1] John M Ziman. 1968. Public knowledge: An essay concerning the social dimension of science. Vol. 519. CUP Archive. [doi:10.1063/1.3035233](https://doi.org/10.1063/1.3035233).<br>\n[2] Paul Ralph. 2016. Practical suggestions for improving scholarly peer review quality and reducing cycle times. _Communications of the Association for Information Systems_ 38, 1 (2016), Article 13, [doi:10.17705/1CAIS.03813](http://doi.org/10.17705/1CAIS.03813).<br>\n[3] Paul Ralph et al. 2020 \"Empirical Standards for Software Engineering Research.\" [_arXiv_:2010.03525](https://arxiv.org/abs/2010.03525).<br>\n",
                "type": "Text_excerpt",
                "original_header": "References",
                "parent_header": [
                    "Empirical Standards"
                ]
            },
            "confidence": 1,
            "technique": "header_analysis",
            "source": "https://raw.githubusercontent.com/acmsigsoft/EmpiricalStandards/master/README.md"
        }
    ],
    "full_title": [
        {
            "result": {
                "type": "String",
                "value": "Empirical Standards"
            },
            "confidence": 1,
            "technique": "regular_expression",
            "source": "https://raw.githubusercontent.com/acmsigsoft/EmpiricalStandards/master/README.md"
        }
    ],
    "related_papers": [
        {
            "result": {
                "type": "Url",
                "value": "https://arxiv.org/abs/2010.03525"
            },
            "confidence": 1,
            "technique": "regular_expression",
            "source": "https://raw.githubusercontent.com/acmsigsoft/EmpiricalStandards/master/README.md"
        }
    ]
}