{
    "somef_provenance": {
        "somef_version": "0.9.5",
        "somef_schema_version": "1.0.0",
        "date": "2024-10-04 01:15:31"
    },
    "code_repository": [
        {
            "result": {
                "value": "https://github.com/sergioburdisso/pyss3",
                "type": "Url"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "owner": [
        {
            "result": {
                "value": "sergioburdisso",
                "type": "User"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "date_created": [
        {
            "result": {
                "value": "2019-11-11T16:14:14Z",
                "type": "Date"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "date_updated": [
        {
            "result": {
                "value": "2024-08-30T09:47:51Z",
                "type": "Date"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "license": [
        {
            "result": {
                "value": "https://api.github.com/licenses/mit",
                "type": "License",
                "name": "MIT License",
                "url": "https://api.github.com/licenses/mit",
                "spdx_id": "MIT"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "description": [
        {
            "result": {
                "value": "A Python package implementing a new interpretable machine learning model for text classification (with visualization tools for Explainable AI :octocat:)",
                "type": "String"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        },
        {
            "result": {
                "type": "Text_excerpt",
                "value": "The SS3 text classifier is a novel and simple supervised machine learning model for text classification which is interpretable, that is, it has the **ability to naturally (self)explain its rationale**. It was originally introduced in Section 3 of the paper _[\"A text classification framework for simple and effective early depression detection over social media streams\"](https://dx.doi.org/10.1016/j.eswa.2019.05.023)_ ([arXiv preprint](https://arxiv.org/abs/1905.08772)).\nThis simple model obtained the best and 2nd-best results, consecutively, in the last three editions of the [CLEF's eRisk lab](https://erisk.irlab.org/) among all participating models [[Burdisso *et al.* 2019](http://ceur-ws.org/Vol-2380/paper_103.pdf); [Loyola *et al.* 2021](http://ceur-ws.org/Vol-2936/paper-81.pdf)].\nGiven its white-box nature, it allows researchers and practitioners to deploy interpretable (i.e. self-explainable) and therefore more reliable, models for text classification (which could be especially useful for those working with classification problems by which people's lives could be somehow affected). \n",
                "original_header": "A Python package implementing a new simple and interpretable model for text classification"
            },
            "confidence": 0.9704315217528231,
            "technique": "supervised_classification",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/README.md"
        },
        {
            "result": {
                "type": "Text_excerpt",
                "value": "[PySS3](https://github.com/sergioburdisso/pyss3) is a Python package that allows you to work with SS3 in a very straightforward, interactive and visual way. In addition to the implementation of the SS3 classifier, PySS3 comes with a set of tools to help you developing your machine learning models in a clearer and faster way. These tools let you analyze, monitor and understand your models by allowing you to see what they have actually learned and why. To achieve this, PySS3 provides you with 3  main components: the ``SS3`` class, the ``Live_Test`` class, and the ``Evaluation`` class, as pointed out below. \n",
                "original_header": "What is PySS3?"
            },
            "confidence": 0.9877540296996588,
            "technique": "supervised_classification",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/README.md"
        },
        {
            "result": {
                "type": "Text_excerpt",
                "value": "This is probably one of the most useful components of PySS3. As the name suggests, this class provides the user easy-to-use methods for model evaluation and hyperparameter optimization, like, for example, the [``test``](https://pyss3.readthedocs.io/en/latest/api/index.html#pyss3.util.Evaluation.test), [``kfold_cross_validation``](https://pyss3.readthedocs.io/en/latest/api/index.html#pyss3.util.Evaluation.kfold_cross_validation), [``grid_search``](https://pyss3.readthedocs.io/en/latest/api/index.html#pyss3.util.Evaluation.grid_search), and [``plot``](https://pyss3.readthedocs.io/en/latest/api/index.html#pyss3.util.Evaluation.plot) methods for performing tests, stratified k-fold cross validations, grid searches for hyperparameter optimization, and visualizing evaluation results using an interactive 3D plot, respectively. Probably one of its most important features is the ability to automatically (and permanently) record the history of evaluations that you've performed. This will save you a lot of time and will allow you to interactively visualize and analyze your classifier performance in terms of its different hyper-parameters values (and select the best model according to your needs). For instance, let's perform a grid search with a 4-fold cross-validation on the three [hyperparameters](https://pyss3.rtfd.io/en/latest/user_guide/ss3-classifier.html#hyperparameters), smoothness(`s`), significance(`l`), and sanction(`p`):\n```python\nfrom pyss3.util import Evaluation\n\nbest_s, best_l, best_p, _ = Evaluation.grid_search(\n    clf, x_train, y_train,\n    s=[0.2, 0.32, 0.44, 0.56, 0.68, 0.8],\n    l=[0.1, 0.48, 0.86, 1.24, 1.62, 2],\n    p=[0.5, 0.8, 1.1, 1.4, 1.7, 2],\n    k_fold=4\n)\n```\nIn this illustrative example, `s`, `l`, and `p` will take those 6 different values each, and once the search is over, this function will return (by default) the hyperparameter values that obtained the best accuracy.\nNow, we could also use the ``plot`` function to analyze the results obtained in our grid search using the interactive 3D evaluation plot:\n \nIn this 3D plot, each point represents an experiment/evaluation performed using that particular combination of values (`s`, `l`, and `p`). Also, these points are painted proportional to how good the performance was according to the selected metric; the plot will update \"on the fly\" when the user select a different evaluation metric (accuracy, precision, recall, f1, etc.). Additionally, when the cursor is moved over a data point, useful information is shown (including a \"compact\" representation of the confusion matrix obtained in that experiment). Finally, it is worth mentioning that, before showing the 3D plots, PySS3 creates a single and portable HTML file in your project folder containing the interactive plots. This allows users to store, send or upload the plots to another place using this single HTML file. For example, we have uploaded two of these files for you to see: [\"Sentiment Analysis (Movie Reviews)\"](https://pyss3.readthedocs.io/en/latest/_static/ss3_model_evaluation[movie_review_3grams].html) and [\"Topic Categorization\"](https://pyss3.readthedocs.io/en/latest/_static/ss3_model_evaluation[topic_categorization_3grams].html), both evaluation plots were also obtained following the [tutorials](https://pyss3.readthedocs.io/en/latest/user_guide/getting-started.html#tutorials). \n",
                "original_header": ":point_right: And last but not least, the `Evaluation` class"
            },
            "confidence": 0.9805951724670565,
            "technique": "supervised_classification",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/README.md"
        }
    ],
    "name": [
        {
            "result": {
                "value": "pyss3",
                "type": "String"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "full_name": [
        {
            "result": {
                "value": "sergioburdisso/pyss3",
                "type": "String"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "issue_tracker": [
        {
            "result": {
                "value": "https://api.github.com/repos/sergioburdisso/pyss3/issues",
                "type": "Url"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "forks_url": [
        {
            "result": {
                "value": "https://api.github.com/repos/sergioburdisso/pyss3/forks",
                "type": "Url"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "stargazers_count": [
        {
            "result": {
                "value": 333,
                "type": "Number"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "keywords": [
        {
            "result": {
                "value": "artificial-intelligence, data-mining, document-categorization, document-classification, early-classification, explainable-artificial-intelligence, interpretability, interpretable-machine-learning, interpretable-ml, machine-learning, machine-learning-algorithms, multilabel-classification, natural-language-processing, nlp, sentence-classification, ss3-classifier, text-classification, text-labeling, text-mining, xai",
                "type": "String"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "forks_count": [
        {
            "result": {
                "value": 44,
                "type": "Number"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "download_url": [
        {
            "result": {
                "value": "https://github.com/sergioburdisso/pyss3/releases",
                "type": "Url"
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "programming_languages": [
        {
            "result": {
                "value": "Python",
                "name": "Python",
                "type": "Programming_language",
                "size": 334711
            },
            "confidence": 1,
            "technique": "GitHub_API"
        },
        {
            "result": {
                "value": "HTML",
                "name": "HTML",
                "type": "Programming_language",
                "size": 57852
            },
            "confidence": 1,
            "technique": "GitHub_API"
        },
        {
            "result": {
                "value": "JavaScript",
                "name": "JavaScript",
                "type": "Programming_language",
                "size": 18099
            },
            "confidence": 1,
            "technique": "GitHub_API"
        },
        {
            "result": {
                "value": "CSS",
                "name": "CSS",
                "type": "Programming_language",
                "size": 758
            },
            "confidence": 1,
            "technique": "GitHub_API"
        }
    ],
    "code_of_conduct": [
        {
            "result": {
                "value": "# PySS3 Code of Conduct\n\n## Our Pledge\n\nWe as members, contributors, and leaders pledge to make participation in our community a harassment-free experience for everyone, regardless of age, body size, visible or invisible disability, ethnicity, sex characteristics, gender identity and expression, level of experience, education, socio-economic status, nationality, personal appearance, race, religion, or sexual identity and orientation.\n\nWe pledge to act and interact in ways that contribute to an open, welcoming, diverse, inclusive, and healthy community.\n\n## Our Standards\n\nExamples of behavior that contributes to a positive environment for our community include:\n\n* Demonstrating empathy and kindness toward other people\n* Being respectful of differing opinions, viewpoints, and experiences\n* Giving and gracefully accepting constructive feedback\n* Accepting responsibility and apologizing to those affected by our mistakes, and learning from the experience\n* Focusing on what is best not just for us as individuals, but for the overall community\n\nExamples of unacceptable behavior include:\n\n* The use of sexualized language or imagery, and sexual attention or\n  advances of any kind\n* Trolling, insulting or derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or email\n  address, without their explicit permission\n* Other conduct which could reasonably be considered inappropriate in a\n  professional setting\n\n## Enforcement Responsibilities\n\nCommunity leaders are responsible for clarifying and enforcing our standards of acceptable behavior and will take appropriate and fair corrective action in response to any behavior that they deem inappropriate, threatening, offensive, or harmful.\n\nCommunity leaders have the right and responsibility to remove, edit, or reject comments, commits, code, wiki edits, issues, and other contributions that are not aligned to this Code of Conduct, and will communicate reasons for moderation decisions when appropriate.\n\n## Scope\n\nThis Code of Conduct applies within all community spaces, and also applies when an individual is officially representing the community in public spaces. Examples of representing our community include using an official e-mail address, posting via an official social media account, or acting as an appointed representative at an online or offline event.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be reported by contacting PySS3 developer Sergio Burdisso via email ([sergio.burdisso@gmail.com](mailto:sergio.burdisso@gmail.com)). All complaints will be reviewed and investigated promptly and fairly.\n\nAll community leaders are obligated to respect the privacy and security of the reporter of any incident.\n\n## Enforcement Guidelines\n\nCommunity leaders will follow these Community Impact Guidelines in determining the consequences for any action they deem in violation of this Code of Conduct:\n\n### 1. Correction\n\n**Community Impact**: Use of inappropriate language or other behavior deemed unprofessional or unwelcome in the community.\n\n**Consequence**: A private, written warning from community leaders, providing clarity around the nature of the violation and an explanation of why the behavior was inappropriate. A public apology may be requested.\n\n### 2. Warning\n\n**Community Impact**: A violation through a single incident or series of actions.\n\n**Consequence**: A warning with consequences for continued behavior. No interaction with the people involved, including unsolicited interaction with those enforcing the Code of Conduct, for a specified period of time. This includes avoiding interactions in community spaces as well as external channels like social media. Violating these terms may lead to a temporary or permanent ban.\n\n### 3. Temporary Ban\n\n**Community Impact**: A serious violation of community standards, including sustained inappropriate behavior.\n\n**Consequence**: A temporary ban from any sort of interaction or public communication with the community for a specified period of time. No public or private interaction with the people involved, including unsolicited interaction with those enforcing the Code of Conduct, is allowed during this period. Violating these terms may lead to a permanent ban.\n\n### 4. Permanent Ban\n\n**Community Impact**: Demonstrating a pattern of violation of community standards, including sustained inappropriate behavior,  harassment of an individual, or aggression toward or disparagement of classes of individuals.\n\n**Consequence**: A permanent ban from any sort of public interaction within the project community.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage], version 2.0,\navailable at https://www.contributor-covenant.org/version/2/0/code_of_conduct.html.\n\nCommunity Impact Guidelines were inspired by [Mozilla's code of conduct enforcement ladder](https://github.com/mozilla/diversity).\n\n[homepage]: https://www.contributor-covenant.org\n\nFor answers to common questions about this code of conduct, see the FAQ at\nhttps://www.contributor-covenant.org/faq. Translations are available at https://www.contributor-covenant.org/translations.\n\n",
                "type": "File_dump"
            },
            "confidence": 1,
            "technique": "file_exploration",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/CODE_OF_CONDUCT.md"
        }
    ],
    "readme_url": [
        {
            "result": {
                "value": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/README.md",
                "type": "Url"
            },
            "confidence": 1,
            "technique": "file_exploration"
        }
    ],
    "contributing_guidelines": [
        {
            "result": {
                "value": "# Contributions\n\nThanks for your interest in the project, you're ![Awesome](https://cdn.rawgit.com/sindresorhus/awesome/d7305f38d29fed78fa85652e3a63e154dd8e8829/media/badge.svg)!!\n\nAny kind of help is very welcome (Code, Bug reports, Content, Data, Documentation, Design, Examples, Ideas, Feedback, etc.),  Issues and/or Pull Requests are welcome for any level of improvement, from a small typo to new features, help us make PySS3 better :+1:\n\nRemember that you can use the \"Edit\" button ('pencil' icon) up the top to [edit any file of this repo directly on GitHub](https://help.github.com/en/github/managing-files-in-a-repository/editing-files-in-your-repository).\n\nIn case you're planning to create a **new Pull Request**, for committing to this repo, we follow the Chris Beams' \"seven rules of a great Git commit message\" from [\"How to Write a Git Commit Message\"](https://chris.beams.io/posts/git-commit/), so make sure your commits follow them as well.\n\nPlease do not hesitate to send an email to sergio.burdisso@gmail.com for anything.",
                "type": "File_dump"
            },
            "confidence": 1,
            "technique": "file_exploration",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/CONTRIBUTING.md"
        },
        {
            "result": {
                "value": "Just go to the [Getting Started](https://pyss3.readthedocs.io/en/latest/user_guide/getting-started.html) page :D\n",
                "type": "Text_excerpt",
                "original_header": "Want to give PySS3 a shot? :eyeglasses: :coffee:",
                "parent_header": [
                    "A Python package implementing a new simple and interpretable model for text classification"
                ]
            },
            "confidence": 1,
            "technique": "header_analysis",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/README.md"
        },
        {
            "result": {
                "value": "Thanks for your interest in the project, you're ![Awesome](https://cdn.rawgit.com/sindresorhus/awesome/d7305f38d29fed78fa85652e3a63e154dd8e8829/media/badge.svg)!!\nAny kind of help is very welcome (Code, Bug reports, Content, Data, Documentation, Design, Examples, Ideas, Feedback, etc.),  Issues and/or Pull Requests are welcome for any level of improvement, from a small typo to new features, help us make PySS3 better :+1:\n\nRemember that you can use the \"Edit\" button ('pencil' icon) up the top to [edit any file of this repo directly on GitHub](https://help.github.com/en/github/managing-files-in-a-repository/editing-files-in-your-repository).\n\nFinally, in case you're planning to create a **new Pull Request**, for committing to this repo, we follow the \"seven rules of a great Git commit message\" from [\"How to Write a Git Commit Message\"](https://chris.beams.io/posts/git-commit/), so make sure your commits follow them as well.\n\n(if you need any further information, please, **do not hesitate** to contact me - sergio.burdisso@gmail.com)\n",
                "type": "Text_excerpt",
                "original_header": "Want to contribute to this Open Source project? :sparkles::octocat::sparkles:",
                "parent_header": [
                    "A Python package implementing a new simple and interpretable model for text classification"
                ]
            },
            "confidence": 1,
            "technique": "header_analysis",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/README.md"
        }
    ],
    "executable_example": [
        {
            "result": {
                "value": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/examples/wordcloud.ipynb",
                "type": "Url",
                "format": "jupyter_notebook"
            },
            "confidence": 1,
            "technique": "file_exploration",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/examples/wordcloud.ipynb"
        },
        {
            "result": {
                "value": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/examples/extract_insight.ipynb",
                "type": "Url",
                "format": "jupyter_notebook"
            },
            "confidence": 1,
            "technique": "file_exploration",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/examples/extract_insight.ipynb"
        },
        {
            "result": {
                "value": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/examples/movie_genres.ipynb",
                "type": "Url",
                "format": "jupyter_notebook"
            },
            "confidence": 1,
            "technique": "file_exploration",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/examples/movie_genres.ipynb"
        },
        {
            "result": {
                "value": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/examples/custom_preprocessing.ipynb",
                "type": "Url",
                "format": "jupyter_notebook"
            },
            "confidence": 1,
            "technique": "file_exploration",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/examples/custom_preprocessing.ipynb"
        },
        {
            "result": {
                "value": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/examples/movie_review.ipynb",
                "type": "Url",
                "format": "jupyter_notebook"
            },
            "confidence": 1,
            "technique": "file_exploration",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/examples/movie_review.ipynb"
        },
        {
            "result": {
                "value": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/examples/topic_categorization.ipynb",
                "type": "Url",
                "format": "jupyter_notebook"
            },
            "confidence": 1,
            "technique": "file_exploration",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/examples/topic_categorization.ipynb"
        },
        {
            "result": {
                "type": "Url",
                "value": "https://mybinder.org/v2/gh/sergioburdisso/pyss3/master?filepath=examples"
            },
            "confidence": 1,
            "technique": "regular_expression",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/README.md"
        }
    ],
    "installation": [
        {
            "result": {
                "value": "\nSimply use:\n```console\npip install pyss3\n```\n",
                "type": "Text_excerpt",
                "original_header": "Installation",
                "parent_header": [
                    "A Python package implementing a new simple and interpretable model for text classification",
                    "Want to give PySS3 a shot? :eyeglasses: :coffee:"
                ]
            },
            "confidence": 1,
            "technique": "header_analysis",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/README.md"
        },
        {
            "result": {
                "type": "Text_excerpt",
                "value": ":sushi: **Online live demos:** http://tworld.io/ss3/ :icecream::ice_cream::cake: \n",
                "original_header": "A Python package implementing a new simple and interpretable model for text classification"
            },
            "confidence": 0.9738462335345947,
            "technique": "supervised_classification",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/README.md"
        }
    ],
    "contributors": [
        {
            "result": {
                "value": "Thanks goes to these awesome people ([emoji key](https://allcontributors.org/docs/en/emoji-key)):\n\n\n\n\n<table>\n  <tr>\n    <td align=\"center\"><a href=\"http://angermeir.me/\"><img src=\"https://avatars3.githubusercontent.com/u/16398152?v=4?s=100\" width=\"100px;\" alt=\"\"/><br /><sub><b>Florian Angermeir</b></sub></a><br /><a href=\"https://github.com/sergioburdisso/pyss3/commits?author=angrymeir\" title=\"Code\">💻</a> <a href=\"#ideas-angrymeir\" title=\"Ideas, Planning, & Feedback\">🤔</a> <a href=\"#data-angrymeir\" title=\"Data\">🔣</a></td>\n    <td align=\"center\"><a href=\"https://www.linkedin.com/in/muneebvaiyani/\"><img src=\"https://avatars3.githubusercontent.com/u/36028992?v=4?s=100\" width=\"100px;\" alt=\"\"/><br /><sub><b>Muneeb Vaiyani</b></sub></a><br /><a href=\"#ideas-Vaiyani\" title=\"Ideas, Planning, & Feedback\">🤔</a> <a href=\"#data-Vaiyani\" title=\"Data\">🔣</a></td>\n    <td align=\"center\"><a href=\"https://www.saurabhbora.com\"><img src=\"https://avatars2.githubusercontent.com/u/29205181?v=4?s=100\" width=\"100px;\" alt=\"\"/><br /><sub><b>Saurabh Bora</b></sub></a><br /><a href=\"#ideas-enthussb\" title=\"Ideas, Planning, & Feedback\">🤔</a></td>\n    <td align=\"center\"><a href=\"https://hbaniecki.com\"><img src=\"https://avatars.githubusercontent.com/u/32574004?v=4?s=100\" width=\"100px;\" alt=\"\"/><br /><sub><b>Hubert Baniecki</b></sub></a><br /><a href=\"#ideas-hbaniecki\" title=\"Ideas, Planning, & Feedback\">🤔</a> <a href=\"https://github.com/sergioburdisso/pyss3/commits?author=hbaniecki\" title=\"Documentation\">📖</a></td>\n  </tr>\n</table>\n\n\n\n\n\n\nThis project follows the [all-contributors](https://github.com/all-contributors/all-contributors) specification. Contributions of any kind welcome!\n",
                "type": "Text_excerpt",
                "original_header": "Contributors :muscle::sunglasses::+1:",
                "parent_header": [
                    "A Python package implementing a new simple and interpretable model for text classification",
                    "Want to contribute to this Open Source project? :sparkles::octocat::sparkles:"
                ]
            },
            "confidence": 1,
            "technique": "header_analysis",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/README.md"
        }
    ],
    "full_title": [
        {
            "result": {
                "type": "String",
                "value": ""
            },
            "confidence": 1,
            "technique": "regular_expression",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/README.md"
        }
    ],
    "documentation": [
        {
            "result": {
                "type": "Url",
                "value": "http://pyss3.readthedocs.io/",
                "format": "readthedocs"
            },
            "confidence": 1,
            "technique": "regular_expression",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/README.md"
        },
        {
            "result": {
                "type": "Url",
                "value": "https://pyss3.readthedocs.io/",
                "format": "readthedocs"
            },
            "confidence": 1,
            "technique": "regular_expression",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/README.md"
        }
    ],
    "logo": [
        {
            "result": {
                "type": "Url",
                "value": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/docs/_static/ss3_logo_banner.png"
            },
            "confidence": 1,
            "technique": "regular_expression",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/README.md"
        }
    ],
    "images": [
        {
            "result": {
                "type": "Url",
                "value": "https://api.travis-ci.com/sergioburdisso/pyss3.svg?branch=master"
            },
            "confidence": 1,
            "technique": "regular_expression",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/README.md"
        },
        {
            "result": {
                "type": "Url",
                "value": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/docs/_static/ss3_live_test.gif"
            },
            "confidence": 1,
            "technique": "regular_expression",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/README.md"
        },
        {
            "result": {
                "type": "Url",
                "value": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/docs/_static/plot_evaluations.gif"
            },
            "confidence": 1,
            "technique": "regular_expression",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/README.md"
        },
        {
            "result": {
                "type": "Url",
                "value": "https://avatars3.githubusercontent.com/u/16398152?v=4?s=100"
            },
            "confidence": 1,
            "technique": "regular_expression",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/README.md"
        },
        {
            "result": {
                "type": "Url",
                "value": "https://avatars3.githubusercontent.com/u/36028992?v=4?s=100"
            },
            "confidence": 1,
            "technique": "regular_expression",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/README.md"
        },
        {
            "result": {
                "type": "Url",
                "value": "https://avatars2.githubusercontent.com/u/29205181?v=4?s=100"
            },
            "confidence": 1,
            "technique": "regular_expression",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/README.md"
        },
        {
            "result": {
                "type": "Url",
                "value": "https://avatars.githubusercontent.com/u/32574004?v=4?s=100"
            },
            "confidence": 1,
            "technique": "regular_expression",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/README.md"
        }
    ],
    "related_papers": [
        {
            "result": {
                "type": "Url",
                "value": "https://arxiv.org/abs/1911.06147"
            },
            "confidence": 1,
            "technique": "regular_expression",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/README.md"
        },
        {
            "result": {
                "type": "Url",
                "value": "https://arxiv.org/abs/1912.09322"
            },
            "confidence": 1,
            "technique": "regular_expression",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/README.md"
        },
        {
            "result": {
                "type": "Url",
                "value": "https://arxiv.org/abs/1905.08772"
            },
            "confidence": 1,
            "technique": "regular_expression",
            "source": "https://raw.githubusercontent.com/sergioburdisso/pyss3/master/README.md"
        }
    ]
}